In [2]:
def my_sq(x):
    return x ** 2

In [5]:
def avg_2(x, y):
    return (x + y) / 2

In [8]:
def avg_2(x, y):
    """두 숫자의 평균을 구하는 함수
    """
    return (x + y) / 2

In [11]:
my_calc_1 = my_sq(4)
print(my_calc_1)

16

In [14]:
my_calc_2 = avg_2(10, 20)
print(my_calc_2)

15.0

In [19]:
import pandas as pd

df = pd.DataFrame({"a": [10, 20, 30], 
                   "b": [20, 30, 40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [24]:
print(df['a'] ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [26]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [29]:
sq = df['a'].apply(my_sq)
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [35]:
df.apply(my_sq)

     a     b
0  100   400
1  400   900
2  900  1600

In [42]:
df.apply(avg_2,y=2)

      a     b
0   6.0  11.0
1  11.0  16.0
2  16.0  21.0

In [44]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [46]:
df.apply(avg_2,y=2,axis=1)

      a     b
0   6.0  11.0
1  11.0  16.0
2  16.0  21.0

In [49]:
def avg_3_apply(col):
    x = col[0]
    y = col[1]
    z = col[2]
    return (x + y + z) / 3

In [52]:
print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64